{"postId":1465848,"headline":"","publishedAt":"2023-05-08T15:09:27.787Z","state":1,"cws":[],"tags":[],"blocks":[{"type":"markdown","markdown":{"content":"English-speaking YouTube dog-trainers sure have an interesting reaction to finding out Finland and Sweden prohibits confining dogs in small crates at home for extended periods."}},{"type":"markdown","markdown":{"content":"No, crates are not banned. The crates can still be used at conformation shows, at events, for veterinary care and aftercare, during transportation, for hunting trips etc. In fact, it’s kind of mandatory to crate a dog in the car."}},{"type":"markdown","markdown":{"content":"Most people just leave the crate door open at home. Like a dog bed. If they have a crate as part of the furnitures."}},{"type":"markdown","markdown":{"content":"And no, it is not required to remove the door."}},{"type":"markdown","markdown":{"content":"It’s more common to confine a dog to a room. But that room need to be sufficiently big enough. You can’t just lock up a dog in the bathroom or in a closet."}},{"type":"markdown","markdown":{"content":"And the law is selectively enforced anyway. Usually neighbours report such incidents. But, it’s like, if people notice that you have a dog but don’t take them outside for walks, then they start getting suspicious."}},{"type":"markdown","markdown":{"content":"Besides, containment isn’t illegal. Confined dogs have a minimum space requirement. But usually most people instead use baby-gates, playpens, kennel runs or a tie-out or a zipline (aka cable trolley) for managing their dogs."}},{"type":"markdown","markdown":{"content":"While the information isn’t always [available in English](https://web.archive.org/web/20210810061115/https://www.lansstyrelsen.se/download/18.10adba9e1616f8edbc975a/1526068739055/Animal-welfare-regulations-dog.pdf), there are enough [second-hand references](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8495059/) in English to figure out what laws are being referred to and to simply use a machine translator once the [original source](https://www.finlex.fi/fi/laki/alkup/2010/20100674) [also [here](https://jordbruksverket.se/djur/hundar-katter-och-smadjur/hundar/sa-skoter-du-din-hund)] is found."}},{"type":"markdown","markdown":{"content":"Or just check the comments under blogs and videos. Usually people will share what is allowed and isn’t allowed since most are bilingually fluent."}},{"type":"markdown","markdown":{"content":"Also, like, Sweden and Finland aren’t the only countries where crating is either uncommon or unheard of. If one use Google, they will find [other countries](https://www.theguardian.com/lifeandstyle/2015/jun/25/dogs-crating-pet-abuse) where the practice isn’t as widely prevalent as it is in the U.S. and Canada. And only became known after Cesar Millan’s books were [translated from English](https://doi.org/10.1163/15685306-12341342) into other languages."}},{"type":"markdown","markdown":{"content":"Gosh, wish dog-influencers actually look things up before making assumptions in their videos."}},{"type":"markdown","markdown":{"content":"Originally posted February 14th, 2023 4:06pm."}}],"pinned":false,"commentsLocked":false,"sharesLocked":false,"singlePostPageUrl":"https://cohost.org/zaryathelaika/post/1465848-english-speaking-you"}